config/cf/InformationRegisters/СвязьПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СвязьПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПервичныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/СвязьПервичныхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСвязьПервичногоДокумента(Знач ПервичныйДокумент, Знач ОбъектСсылка) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи 					= РегистрыСведений.СвязьПервичныхДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПервичныйДокумент= ПервичныйДокумент;
	МенеджерЗаписи.Объект			= ОбъектСсылка;
	МенеджерЗаписи.Дата				= ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь		= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьСвязьПервичногоДокумента(Знач ПервичныйДокумент, Знач ОбъектСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи 					= РегистрыСведений.СвязьПервичныхДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПервичныйДокумент= ПервичныйДокумент;
	МенеджерЗаписи.Объект			= ОбъектСсылка;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
